app/Controllers/Auth.php

    public function login()
    {
        $session = session();
        $userModel = new UsuarioModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        // Buscar por email o username
        $user = $userModel->where('email', $email)
                          ->orWhere('username', $email)
                          ->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'est_01'
OR `username` = 'est_01'
 LIMIT 1