app/Controllers/Dashboard.php

SELECT *
FROM `notificaciones`
WHERE `usuario_id` = '51'
ORDER BY `fecha_envio` DESC
 LIMIT 5
---
    public function estudiante()
    {
        $session = session();

        // Verificar si el usuario está autenticado
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('auth'));
        }

        $usuarioId = $session->get('id_usuario');

        // Obtener notificaciones del estudiante (últimas 5)
        $notificaciones = $this->notificacionModel
            ->where('usuario_id', $usuarioId)
            ->orderBy('fecha_envio', 'DESC')
            ->limit(5)
            ->findAll();

        // Contar notificaciones no leídas
        $noLeidas = $this->notificacionModel
            ->where('usuario_id', $usuarioId)
            ->where('leido', 0)
            ->countAllResults();

        // Obtener cursos del estudiante
        $cursos = $this->cursoModel->getCursosPorEstudiante($usuarioId);

        return view('dashboard/estudiante', [
            'nombre' => $session->get('nombre'),
            'notificaciones' => $notificaciones,
            'notificaciones_no_leidas' => $noLeidas,
            'cursos' => $cursos
        ]);