app/Controllers/Estudiantes.php

SELECT `c`.`id`, `c`.`nombre`, `c`.`codigo_curso`, `d`.`nombres` as `docente_nombres`, `d`.`apellidos` as `docente_apellidos`
FROM `matriculas`
JOIN `cursos` `c` ON `c`.`id` = `matriculas`.`curso_id`
JOIN `docentes` `d` ON `d`.`id` = `c`.`docente_id`
WHERE `matriculas`.`estudiante_id` = '34'
---
    public function cursos()
    {
        $usuarioId = session('id_usuario');

        $estudiante = $this->estudianteModel->getByUsuarioId($usuarioId);

        if (!$estudiante) {
            return redirect()->to('dashboard')->with('error', 'Estudiante no encontrado.');
        }

        $cursos = $this->matriculaModel
            ->select('c.id, c.nombre, c.codigo_curso, d.nombres as docente_nombres, d.apellidos as docente_apellidos')
            ->join('cursos c', 'c.id = matriculas.curso_id')
            ->join('docentes d', 'd.id = c.docente_id')
            ->where('matriculas.estudiante_id', $estudiante['id'])
            ->findAll();

SELECT *
FROM `tramites`
WHERE `estudiante_id` = '34'
ORDER BY `fecha_solicitud` DESC
---
        public function tramites()
    {
        $usuarioId = session('id_usuario');
        $estudiante = $this->estudianteModel->getByUsuarioId($usuarioId);

        if (!$estudiante) {
            return redirect()->back()->with('error', 'Estudiante no encontrado.');
        }

        $tramites = $this->tramiteModel
            ->where('estudiante_id', $estudiante['id'])
            ->orderBy('fecha_solicitud', 'DESC')
            ->findAll();

SELECT *
FROM `matriculas`
WHERE `estudiante_id` = '34'
AND `curso_id` = '14'
 LIMIT 1
SELECT *
FROM `cursos`
WHERE `cursos`.`id` = '14'
---
    public function verCalificaciones($cursoId)
    {
        $usuarioId = session('id_usuario');
        $estudiante = $this->estudianteModel->getByUsuarioId($usuarioId);

        if (!$estudiante) {
            return redirect()->back()->with('error', 'Estudiante no encontrado.');
        }

        // Verificar que el estudiante está matriculado en el curso
        $matricula = $this->matriculaModel
            ->where('estudiante_id', $estudiante['id'])
            ->where('curso_id', $cursoId)
            ->first();

        if (!$matricula) {
            return redirect()->back()->with('error', 'No está matriculado en este curso.');
        }

        $curso = $this->cursoModel->find($cursoId);

SELECT IFNULL(SUM(c.creditos), 0) as creditos_acumulados
FROM `matriculas` `m`
JOIN `cursos` `c` ON `c`.`id` = `m`.`curso_id`
WHERE `m`.`estudiante_id` = '34'
AND `m`.`estado` = 'finalizado'
---
    public function cursosDisponibles()
    {
        $usuarioId = session('id_usuario');
        $estudiante = $this->estudianteModel->getByUsuarioId($usuarioId);

        if (!$estudiante) {
            return redirect()->back()->with('error', 'Estudiante no encontrado.');
        }

        // Verificar si tiene solicitud aprobada
        $periodo = $this->periodoAcademicoModel->getPeriodoProximo() ?? $this->periodoAcademicoModel->getPeriodoActual();
        if (!$periodo) {
            return redirect()->back()->with('error', 'No hay periodo académico disponible.');
        }

        $solicitud = $this->solicitudMatriculaModel->getSolicitudPorEstudiante($estudiante['id'], $periodo['id']);

        if (!$solicitud || $solicitud['estado'] !== 'aprobado') {
            return redirect()->to(base_url('estudiantes/matricula/solicitar'))->with('error', 'Debe tener solicitud aprobada para matricularse.');
        }

        // Calcular ciclo actual del estudiante según créditos acumulados
        $db = \Config\Database::connect();
        $creditosData = $db->table('matriculas m')
            ->select('IFNULL(SUM(c.creditos), 0) as creditos_acumulados')
            ->join('cursos c', 'c.id = m.curso_id')
            ->where('m.estudiante_id', $estudiante['id'])
            ->where('m.estado', 'finalizado')
            ->get()
            ->getRowArray();

SELECT `cursos`.*
FROM `cursos`
WHERE `cursos`.`carrera_id` = '1'
AND `cursos`.`ciclo` = 1
ORDER BY `cursos`.`codigo_curso` ASC
---
        }

        // Obtener solo cursos del ciclo actual del estudiante con información de horarios
        $cursos = $db->table('cursos')
            ->select('cursos.*')
            ->where('cursos.carrera_id', $estudiante['carrera_id'])
            ->where('cursos.ciclo', $cicloActual)
            ->orderBy('cursos.codigo_curso', 'ASC')
            ->get()
            ->getResultArray();

SELECT `ph`.*, CONCAT(d.nombres, " ", d.apellidos) as docente_nombre
FROM `programacion_horaria` `ph`
LEFT JOIN `docentes` `d` ON `d`.`id` = `ph`.`docente_id`
WHERE `ph`.`curso_id` = '14'
AND `ph`.`periodo_id` = '3'
AND `ph`.`activo` = 1
---

        foreach ($cursos as $curso) {
            // Obtener información de programación horaria con docente
            $horarios = $db->table('programacion_horaria ph')
                ->select('ph.*, CONCAT(d.nombres, " ", d.apellidos) as docente_nombre')
                ->join('docentes d', 'd.id = ph.docente_id', 'left')
                ->where('ph.curso_id', $curso['id'])
                ->where('ph.periodo_id', $periodo['id'])
                ->where('ph.activo', 1)
                ->get()
                ->getResultArray();

SELECT *
FROM `matriculas`
WHERE `estudiante_id` = '34'
AND `curso_id` = '14'
AND `periodo_id` = '3'
 LIMIT 1
---
            $curso['docente_nombres'] = !empty($horarios) ? $horarios[0]['docente_nombre'] : 'Sin asignar';

            // Verificar si ya está matriculado
            $yaMatriculado = $this->matriculaModel
                ->where('estudiante_id', $estudiante['id'])
                ->where('curso_id', $curso['id'])
                ->where('periodo_id', $periodo['id'])
                ->first();