app/Controllers/Pagos.php

    public function indexEstudiante()
    {
        $usuarioId = session('id_usuario');

        // Obtener estudiante
        $estudianteModel = new \App\Models\EstudianteModel();
        $tramiteModel    = new \App\Models\TramiteModel();

        $estudiante = $estudianteModel->getByUsuarioId($usuarioId);

        if (!$estudiante) {
            return redirect()->back()->with('error', 'Estudiante no encontrado.');
        }

        // Traer trámites del estudiante
        $tramites = $tramiteModel
            ->where('estudiante_id', $estudiante['id'])
            ->orderBy('fecha_solicitud', 'DESC')
            ->findAll();
---
SELECT *
FROM `tramites`
WHERE `estudiante_id` = '34'
ORDER BY `fecha_solicitud` DESC