app/Models/CursoModel.php

    public function getCursosPorEstudiante($usuarioId)
    {
        return $this->select("cursos.*, docentes.nombres AS docente_nombres, docentes.apellidos AS docente_apellidos")
            ->join('matriculas', 'matriculas.curso_id = cursos.id')
            ->join('estudiantes', 'estudiantes.id = matriculas.estudiante_id')
            ->join('docentes', 'docentes.id = cursos.docente_id', 'left')
            ->where('estudiantes.usuario_id', $usuarioId)
            ->findAll();
---
SELECT `cursos`.*, `docentes`.`nombres` AS `docente_nombres`, `docentes`.`apellidos` AS `docente_apellidos`
FROM `cursos`
JOIN `matriculas` ON `matriculas`.`curso_id` = `cursos`.`id`
JOIN `estudiantes` ON `estudiantes`.`id` = `matriculas`.`estudiante_id`
LEFT JOIN `docentes` ON `docentes`.`id` = `cursos`.`docente_id`
WHERE `estudiantes`.`usuario_id` = '51'