app/Models/EstudianteModel.php

    public function getByUsuarioId($usuario_id)
    {
        return $this->where('usuario_id', $usuario_id)
                    ->join('carreras', 'carreras.id = estudiantes.carrera_id')
                    ->select('estudiantes.*, carreras.nombre AS carrera')
                    ->first();
---
SELECT `estudiantes`.*, `carreras`.`nombre` AS `carrera`
FROM `estudiantes`
JOIN `carreras` ON `carreras`.`id` = `estudiantes`.`carrera_id`
WHERE `usuario_id` = '51'
 LIMIT 1