app/Models/MatriculaModel.php

    public function getMatriculasPorEstudiante($usuarioId)
    {
        return $this->select("
                    matriculas.*,
                    cursos.nombre AS curso,
                    periodos_academicos.nombre AS periodo")
            ->join('estudiantes', 'estudiantes.id = matriculas.estudiante_id')
            ->join('cursos', 'cursos.id = matriculas.curso_id')
            ->join('periodos_academicos', 'periodos_academicos.id = matriculas.periodo_id')
            ->where('estudiantes.usuario_id', $usuarioId)
            ->findAll();
---
SELECT `matriculas`.*, `cursos`.`nombre` AS `curso`, `periodos_academicos`.`nombre` AS `periodo`
FROM `matriculas`
JOIN `estudiantes` ON `estudiantes`.`id` = `matriculas`.`estudiante_id`
JOIN `cursos` ON `cursos`.`id` = `matriculas`.`curso_id`
JOIN `periodos_academicos` ON `periodos_academicos`.`id` = `matriculas`.`periodo_id`
WHERE `estudiantes`.`usuario_id` = '51'