app/Models/PrerrequisitoModel.php

    public function getPrerrequisitos($cursoId)
    {
        return $this->select('prerrequisitos.*, cursos.nombre as curso_prerrequisito, cursos.codigo_curso')
            ->join('cursos', 'cursos.id = prerrequisitos.curso_prerrequisito_id')
            ->where('prerrequisitos.curso_id', $cursoId)
            ->findAll();
---
SELECT `prerrequisitos`.*, `cursos`.`nombre` as `curso_prerrequisito`, `cursos`.`codigo_curso`
FROM `prerrequisitos`
JOIN `cursos` ON `cursos`.`id` = `prerrequisitos`.`curso_prerrequisito_id`
WHERE `prerrequisitos`.`curso_id` = '14'