app/Models/ProgramacionHorariaModel.php

    public function verificarConflictoHorario($estudianteId, $cursoId, $periodoId)
    {
        $db = \Config\Database::connect();

        // 1. Obtener horarios del nuevo curso
        $horariosNuevoCurso = $this->where('curso_id', $cursoId)
            ->where('periodo_id', $periodoId)
            ->where('activo', 1)
            ->findAll();

        if (empty($horariosNuevoCurso)) {
            return [
                'conflicto' => false,
                'mensaje' => 'Curso sin programación horaria',
                'detalles' => []
            ];
        }

        // 2. Obtener cursos ya matriculados del estudiante
        $cursosMatriculados = $db->table('matriculas')
            ->select('curso_id')
            ->where('estudiante_id', $estudianteId)
            ->where('periodo_id', $periodoId)
            ->where('estado', 'matriculado')
            ->get()->getResultArray();
---
SELECT *
FROM `programacion_horaria`
WHERE `curso_id` = '14'
AND `periodo_id` = '3'
AND `activo` = 1
SELECT `curso_id`
FROM `matriculas`
WHERE `estudiante_id` = '34'
AND `periodo_id` = '3'
AND `estado` = 'matriculado'

    public function verificarCuposDisponibles($cursoId, $periodoId)
    {
        $programacion = $this->where('curso_id', $cursoId)
            ->where('periodo_id', $periodoId)
            ->where('activo', 1)
            ->first();
---
SELECT *
FROM `programacion_horaria`
WHERE `curso_id` = '14'
AND `periodo_id` = '3'
AND `activo` = 1
 LIMIT 1